src/cf/InformationRegisters/GDS_ВыработкаПоПоследнемуТО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>GDS_ВыработкаПоПоследнемуТО</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МЧВО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Одометр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МЧДВС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатРемонтныйЛист</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОбслуживания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВидыОбслуживанияТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/GDS_РаботаСПодпискамиНаСобытие/Ext/Module.bsl
Процедура GDS_ОбработкаЗаполненияРемонтныйЛист(Источник, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.GDS_АктПриемаПередачиТС") Тогда
		
		Источник.Дата = ТекущаяДата();
		Источник.Организация = ДанныеЗаполнения.Организация;
		Источник.ТС = ДанныеЗаполнения.ТС;
		
		
		
		сс="";
		
	КонецЕсли;
	
КонецПроцедуры

Процедура РемонтныйЛистПриЗаписи(Источник, Отказ) Экспорт

	Если Не ЗначениеЗаполнено(Источник.GDS_ПУ) Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Поле ""ПУ на котором был выполнен ремонт"" не заполнено";
		Сообщение.Поле = "GDS_ПУ";
		Сообщение.ПутьКДанным = "Объект";
		Сообщение.КлючДанных = Источник.Ссылка;
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
	Если Не Отказ и ЗначениеЗаполнено(Источник.Ссылка) Тогда
		
		//сначала зачистим регистр
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
		                      |	GDS_ВыработкаПоПоследнемуТО.ТранспортноеСредство КАК ТранспортноеСредство,
		                      |	GDS_ВыработкаПоПоследнемуТО.ВидОбслуживания КАК ВидОбслуживания,
		                      |	GDS_ВыработкаПоПоследнемуТО.Период КАК Период
		                      |ИЗ
		                      |	РегистрСведений.GDS_ВыработкаПоПоследнемуТО КАК GDS_ВыработкаПоПоследнемуТО
		                      |ГДЕ
		                      |	GDS_ВыработкаПоПоследнемуТО.ДокументОснование = &ДокументОснование");
		Запрос.УстановитьПараметр("ДокументОснование", Источник.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			НаборЗаписей = РегистрыСведений.GDS_ВыработкаПоПоследнемуТО.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
			НаборЗаписей.Отбор.ТранспортноеСредство.Установить(Выборка.ТранспортноеСредство);
			НаборЗаписей.Отбор.ВидОбслуживания.Установить(Выборка.ВидОбслуживания);
			НаборЗаписей.Прочитать();
			
			КолЗаписей = НаборЗаписей.количество();
			Для Счетчик = 1 по КолЗаписей Цикл 
			    Запись = НаборЗаписей[КолЗаписей-Счетчик];
			    Если Запись.ДокументОснование = Источник.Ссылка тогда 
			        НаборЗаписей.Удалить(Запись); 
			    КонецЕсли; 
			КонецЦикла;
			
			НаборЗаписей.Записать();
			
		КонецЦикла;
		
		//сформируем новые записи
		Если Источник.Выполнен = Истина И Источник.ПометкаУдаления = Ложь и Источник.Проведен Тогда
			Если СтрНайти(Источник.ВидОбслуживания.Наименование, "ТО -") > 0 Тогда
				ЗаписьВРегистрНаработкиПредыдущегоТО(Источник.ВидОбслуживания, Источник.Ссылка);			
			КонецЕсли;
			Если СтрНайти(Источник.ВидОбслуживания2.Наименование, "ТО -") > 0 Тогда
				ЗаписьВРегистрНаработкиПредыдущегоТО(Источник.ВидОбслуживания2, Источник.Ссылка);			
			КонецЕсли;
			Если СтрНайти(Источник.ВидОбслуживания3.Наименование, "ТО -") > 0 Тогда
				ЗаписьВРегистрНаработкиПредыдущегоТО(Источник.ВидОбслуживания3, Источник.Ссылка);			
			КонецЕсли;
			Если СтрНайти(Источник.GDS_ВидОбслуживания4.Наименование, "ТО -") > 0 Тогда
				ЗаписьВРегистрНаработкиПредыдущегоТО(Источник.GDS_ВидОбслуживания4, Источник.Ссылка);			
			КонецЕсли;
			Если СтрНайти(Источник.GDS_ВидОбслуживания5.Наименование, "ТО -") > 0 Тогда
				ЗаписьВРегистрНаработкиПредыдущегоТО(Источник.GDS_ВидОбслуживания5, Источник.Ссылка);			
			КонецЕсли;
		КонецЕсли;
		
		
		
	КонецЕсли;
	
КонецПроцедуры


Функция ЗаписьВРегистрНаработкиПредыдущегоТО(ВидОбслуживания, ДокументОснование)
	
	НовЗапись = РегистрыСведений.GDS_ВыработкаПоПоследнемуТО.СоздатьМенеджерЗаписи();
	НовЗапись.Период = ДокументОснование.Дата + 1;
	НовЗапись.ТранспортноеСредство = ДокументОснование.ТС;
	НовЗапись.ВидОбслуживания   = ВидОбслуживания;
	НовЗапись.МЧВО              = ДокументОснование.GDS_ТекущаяНаработкаМЧ_ВО;
	НовЗапись.МЧДВС             = ДокументОснование.GDS_ТекущаяНаработкаМЧ_ДВС;
	НовЗапись.Одометр           = ДокументОснование.GDS_ТекущаяНаработкаОдометр;
	НовЗапись.ДокументОснование = ДокументОснование;
	НовЗапись.Записать(Истина);
	
	//КолЗаписей = НаборЗаписей.количество();
	//Для Счетчик = 1 по КолЗаписей Цикл 
	//    Запись = НаборЗаписей[КолЗаписей-Счетчик];
	//    Если Запись.Ресурс = 5 тогда 
	//        НаборЗаписей.Удалить(Запись); 
	//    КонецЕсли; 
	//КонецЦикла;
	
КонецФункции
